Revit 2026 API

# BoundingBoxXYZMax Property

---

Maximum coordinates (upper-right-front corner of the box).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Max { get; set; }
```
```vb
Public Property Max As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Max {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Max : XYZ with get, set
```

#### Property Value

XYZ

The bounds are defined in the coordinate space of the box.

#### Reference

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace